<?xml version="1.0" encoding="UTF-8"?>
<Section>
  <Heading>Presentations of Numerical Semigroups</Heading>

  In this section we provide a way to compute minimal presentations of a numerical semigroup. These presentations are constructed from some special elelements in the semigroup (Betti elemenents) whose associated graphs are nonconnected. A generalization of these graphs are the simplicial complexes called shaded sets of an element.<P/>

  If the variable <A>NumSgpsUseEliminationForMinimalPresentations</A> is set to true, then minimal presentations are computed via binomial ideals and elimination.

  <ManSection>

    <Oper Arg="S" Name="MinimalPresentation" Label="for numerical semigroups"></Oper>
    <Func Arg="S" Name="MinimalPresentationOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.

      The output is a list of lists with two elements. Each list of two elements represents
      a relation between the minimal generators of the numerical semigroup. If
      <M> \{ \{x_1,y_1\},\ldots,\{x_k,y_k\}\} </M> is the output
      and <M> \{m_1,\ldots,m_n\} </M> is the minimal system of generators
      of the numerical semigroup, then
      <M> \{x_i,y_i\}=\{\{a_{i_1},\ldots,a_{i_n}\},\{b_{i_1},\ldots,b_{i_n}\}\}</M>
      and <M> a_{i_1}m_1+\cdots+a_{i_n}m_n= b_{i_1}m_1+ \cdots +b_{i_n}m_n.</M>
      <P/>

      Any other relation among the minimal generators of the semigroup can be deduced from
      the ones given in the output.
      <P/>

      The algorithm implemented is described in <Cite Key="Ros96"></Cite>
      (see also  <Cite Key="RGS99"></Cite>).

      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> MinimalPresentation(s);
[ [ [ 0, 0, 2 ], [ 3, 1, 0 ] ], [ [ 0, 1, 1 ], [ 4, 0, 0 ] ], 
  [ [ 0, 2, 0 ], [ 1, 0, 1 ] ] ]
gap> MinimalPresentationOfNumericalSemigroup(s);
[ [ [ 0, 0, 2 ], [ 3, 1, 0 ] ], [ [ 0, 1, 1 ], [ 4, 0, 0 ] ], 
  [ [ 0, 2, 0 ], [ 1, 0, 1 ] ] ]
]]></Example>
      The first element in the list means that <M> 1\times 3+1\times 7=2\times 5 </M>,
      and the others have similar meanings.
    </Description>
  </ManSection>

  <ManSection>
    <Func Arg="n, S" Name="GraphAssociatedToElementInNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup and <A>n</A> is an element in <A>S</A>.
      <P/>
      The output is a pair. If <M> \{m_1,\ldots,m_n\} </M> is the set of minimal
      generators of <A>S</A>, then the first component is the set of vertices of the graph
      associated to <A>n</A> in <A>S</A>, that is, the set
      <M>\{ m_i \ |\  n-m_i\in S\} </M>,
      and the second component is the set of edges of this graph, that is,
      <M> \{ \{m_i,m_j\} \ |\  n-(m_i+m_j)\in S\}.</M>

      <P/>
      This function is used to compute a minimal presentation of the numerical semigroup
      <A>S</A>, as explained in <Cite Key="Ros96"></Cite>.
      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> GraphAssociatedToElementInNumericalSemigroup(10,s);
[ [ 3, 5, 7 ], [ [ 3, 7 ] ] ]
]]></Example>
    </Description>
  </ManSection>

  <ManSection>
    <Oper Arg="S" Name="BettiElements" Label="of numerical semigroup"></Oper>
    <Func Arg="S" Name="BettiElementsOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is the set of elements in <A>S</A> whose associated graph is nonconnected <Cite Key="GS-O"></Cite>.
      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> BettiElementsOfNumericalSemigroup(s);
[ 10, 12, 14 ]
gap> BettiElements(s);
[ 10, 12, 14 ]
]]></Example>
    </Description>
  </ManSection>

  <ManSection>
    <Func Arg="p,S" Name="IsMinimalRelationOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup and <A>p</A> is a pair (a relation) of lists of integers. Determines if the pair <A>p</A> is a minimal relation in a minimal presentation of <A>S</A>.
      <P/>
      <Example><![CDATA[
gap> s:=NumericalSemigroup(4,6,9);;
gap> MinimalPresentation(s);
[ [ [ 0, 0, 2 ], [ 0, 3, 0 ] ], [ [ 0, 2, 0 ], [ 3, 0, 0 ] ] ]
gap> IsMinimalRelationOfNumericalSemigroup([[2,1,0],[0,0,2]],s);
false
gap> IsMinimalRelationOfNumericalSemigroup([[3,1,0],[0,0,2]],s);
true
]]></Example>
    </Description>
  </ManSection>

<ManSection>
<Func Arg="S" Name="AllMinimalRelationsOfNumericalSemigroup"></Func>
<Description>
  <A>S</A> is a numerical semigroup.

      The output is the union of all minimal presentations of <A>S</A>. Notice that if [x,y] is a minimal relator, then either [x,y] or [y,x] will be in the output, but not both.

      <Example><![CDATA[
gap> s:=NumericalSemigroup(4,6,9);;
gap> MinimalPresentation(s);
[ [ [ 0, 0, 2 ], [ 0, 3, 0 ] ], [ [ 0, 2, 0 ], [ 3, 0, 0 ] ] ]
gap> AllMinimalRelationsOfNumericalSemigroup(s);
[ [ [ 0, 3, 0 ], [ 0, 0, 2 ] ], [ [ 3, 0, 0 ], [ 0, 2, 0 ] ], [ [ 3, 1, 0 ], [ 0, 0, 2 ] ] ]
]]></Example>

  </Description>
</ManSection>



  <ManSection>
    <Func Arg="S" Name="DegreesOfPrimitiveElementsOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is the set of elements <M>s</M> in <A>S</A> such that  there exists a minimal  solution to <M>msg\cdot x-msg\cdot y = 0</M>,  such that <M>x,y</M> are factorizations of <M>s</M>, and <M>msg</M> is the minimal generating system of <A>S</A>. Betti elements are primitive, but not the way around in general.
      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> DegreesOfPrimitiveElementsOfNumericalSemigroup(s);
[ 3, 5, 7, 10, 12, 14, 15, 21, 28, 35 ]
]]></Example>
    </Description>
  </ManSection>


  <ManSection Label="shadedset">
    <Func Arg="n, S" Name="ShadedSetOfElementInNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup and <A>n</A> is an element in <A>S</A>.

      <P/>
      The output is a simplicial complex <M>C</M>. If <M> \{m_1,\ldots,m_n\} </M> is the set of minimal
      generators of <A>S</A>, then <M>L \in C</M> if
      <M>n-\sum_{i\in L} m_i\in S</M> (<Cite Key="SzW"></Cite>).
      <P/>
      This function is a generalization of the graph associated to <A>n</A>.

      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> ShadedSetOfElementInNumericalSemigroup(10,s);
[ [  ], [ 3 ], [ 3, 7 ], [ 5 ], [ 7 ] ]
]]></Example>
    </Description>
  </ManSection>
</Section>


<Section>
<Heading>Binomial ideals associated to numerical semigroups</Heading>

Let <M>S</M> be a numerical semigroup, and let <M>K</M> be a field. Let <M>\{n_1,\dots,n_e\}</M> be a set of minimal generators of <M>S</M>, and let <M>K[x_1,\dots,x_e]</M> be the ring of polynomial in the indeterminates <M>x_1,\dots,x_e</M> and with coefficients in <M>K</M>. Let <M>K[t]</M> be the ring of polynomials in <M>t</M> with coefficients in <M>K</M>.<P/>

Let <M>\varphi: K[x_1,\dots,x_e] \to K[t]</M> be the ring homomorphism determined by <M>\varphi(x_i)=t^{n_i}</M> for all <M>i</M>. The image of this morphism is usually known as the <E>semigroup ring associated</E> to <M>S</M>. The kernel is the <E>(binomial) ideal associated</E> to <M>S</M>. According to <Cite Key="MR0269762"></Cite>, from the exponents of the binomials in this ideal we can recover a presentation of <M>S</M> and viceversa.

<ManSection>
<Oper Arg="[K,]S" Name="BinomialIdealOfNumericalSemigroup"></Oper>
<Description>
The argument <A>K</A> is optional; when it is not supplied, the field of rational numbers is taken as base field. <A>S</A> is a numerical semigroup. The output is the binomial ideal associated to <A>S</A>.
<Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> BinomialIdealOfNumericalSemigroup(GF(2),s);
<two-sided ideal in GF(2)[x_1,x_2,x_3], (3 generators)>
gap> GeneratorsOfTwoSidedIdeal(last);
[ x_1^3*x_2+x_3^2, x_1^4+x_2*x_3, x_1*x_3+x_2^2 ]
gap> BinomialIdealOfNumericalSemigroup(s);
<two-sided ideal in Rationals[x_1,x_2,x_3], (3 generators)>
gap> GeneratorsOfTwoSidedIdeal(last);
[ -x_1^3*x_2+x_3^2, -x_1^4+x_2*x_3, -x_1*x_3+x_2^2 ]
gap> MinimalPresentation(s);
[ [ [ 0, 0, 2 ], [ 3, 1, 0 ] ], [ [ 0, 1, 1 ], [ 4, 0, 0 ] ], 
[ [ 0, 2, 0 ], [ 1, 0, 1 ] ] ]
]]></Example>
</Description>
</ManSection>

</Section>


<Section>
  <Heading>Uniquely Presented Numerical Semigroups</Heading>

  A numerical semigroup <M>S</M> is uniquely presented if for any two minimal presentations <M>\sigma</M> and <M>\tau</M> and any <M>(a,b)\in \sigma</M>, either <M>(a,b)\in \tau</M> or <M>(b,a)\in \tau</M>, that is, there is essentially a unique minimal presentation (up to arrangement of the components of the pairs in it).
  <ManSection Label="UniqPre">
    <Prop Arg="S" Name="IsUniquelyPresented" Label="for numerical semigroups"></Prop>
    <Prop Arg="S" Name="IsUniquelyPresentedNumericalSemigroup"></Prop>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is true if <A>S</A> has uniquely presented. The implementation is based on <Cite Key="GS-O"></Cite>.
      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> IsUniquelyPresented(s);
true
gap> IsUniquelyPresentedNumericalSemigroup(s);
true
]]></Example>
    </Description>
  </ManSection>

  <ManSection Label="Generic">
    <Prop Arg="S" Name="IsGeneric" Label="for numerical semigroups"></Prop>
    <Prop Arg="S" Name="IsGenericNumericalSemigroup"></Prop>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is true if <A>S</A> has a generic presentation, that is, in every minimal relation all generators occur. These semigroups are uniquely presented  (see <Cite Key="B-GS-G"></Cite>).

      <P/>
      This filter implies <Ref Func="IsUniquelyPresentedNumericalSemigroup"/>.
      <Example><![CDATA[
gap> s:=NumericalSemigroup(3,5,7);;
gap> IsGeneric(s);
true
gap> IsGenericNumericalSemigroup(s);
true
]]></Example>
    </Description>
  </ManSection>
</Section>
